feat(docs): update docs to include mermaid diagrams
